Repository: skvdhshuk-blip/hao-bar
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, id, it, ja, ko, nl, pt_br, th, vi, zh_hans, zh_hant

source: Reveal chosen menu bar icons automatically when selected apps launch
de: Blendet die gewählten Menüleisten-Symbole automatisch ein, wenn ausgewählte Apps starten.
es: Muestra automáticamente los iconos elegidos cuando se abren las apps seleccionadas.
fr: Affiche automatiquement les icônes choisies quand les apps sélectionnées s’ouvrent.
id: Tampilkan ikon yang dipilih secara otomatis saat app terpilih dibuka.
it: Mostra automaticamente le icone scelte all’apertura delle app selezionate.
ja: 選んだアプリが起動すると、指定したメニューバーアイコンを自動表示します。
ko: 선택한 앱이 실행되면 지정한 메뉴 막대 아이콘을 자동으로 표시합니다.
nl: Toont automatisch de gekozen menubalkiconen als de geselecteerde apps starten.
pt_br: Mostra automaticamente os ícones escolhidos quando os apps selecionados abrem.
th: แสดงไอคอนที่เลือกอัตโนมัติเมื่อเปิดแอปที่กำหนด
vi: Tự hiện các biểu tượng đã chọn khi ứng dụng được chọn mở.
zh_hans: 所选 App 启动时，自动显示指定的菜单栏图标。
zh_hant: 所選 App 啟動時，自動顯示指定的選單列圖示。

source: Reveal hidden icons only during selected days and time windows
de: Blendet ausgeblendete Symbole nur an den gewählten Tagen und Zeiten ein.
es: Muestra los iconos ocultos solo en los días y franjas horarias seleccionados.
fr: N’affiche les icônes masquées que pendant les jours et plages horaires choisis.
id: Tampilkan ikon tersembunyi hanya pada hari dan jam yang dipilih.
it: Mostra le icone nascoste solo nei giorni e negli orari selezionati.
ja: 選んだ曜日と時間帯だけ、非表示アイコンを表示します。
ko: 선택한 요일과 시간대에만 숨긴 아이콘을 표시합니다.
nl: Toont verborgen iconen alleen op de gekozen dagen en tijden.
pt_br: Mostra os ícones ocultos só nos dias e horários selecionados.
th: แสดงไอคอนที่ซ่อนเฉพาะวันที่และช่วงเวลาที่เลือก
vi: Chỉ hiện biểu tượng ẩn vào ngày giờ đã chọn.
zh_hans: 仅在选定的星期和时间段显示隐藏图标。
zh_hant: 僅在選定的星期與時段顯示隱藏圖示。

source: Reveal selected icons when your Mac joins specific Wi-Fi networks
de: Blendet die gewählten Symbole ein, wenn der Mac bestimmte WLAN-Netze betritt.
es: Muestra los iconos seleccionados cuando el Mac se une a redes Wi-Fi concretas.
fr: Affiche les icônes choisies quand le Mac rejoint certains réseaux Wi-Fi.
id: Tampilkan ikon terpilih saat Mac terhubung ke jaringan Wi-Fi tertentu.
it: Mostra le icone selezionate quando il Mac si collega a reti Wi-Fi specifiche.
ja: 特定のWi-Fiに接続すると、選んだアイコンを表示します。
ko: 특정 Wi-Fi에 연결되면 선택한 아이콘을 표시합니다.
nl: Toont de gekozen iconen als de Mac met bepaalde wifinetwerken verbindt.
pt_br: Mostra os ícones selecionados quando o Mac entra em redes Wi-Fi específicas.
th: แสดงไอคอนที่เลือกเมื่อ Mac เข้าสู่เครือข่าย Wi-Fi ที่กำหนด
vi: Hiện biểu tượng đã chọn khi Mac vào mạng Wi-Fi chỉ định.
zh_hans: Mac 连上指定 Wi-Fi 时，显示所选图标。
zh_hant: Mac 連上指定 Wi-Fi 時，顯示所選圖示。

source: Reveal selected icons when Focus turns on, changes, or turns off
de: Blendet die gewählten Symbole ein, wenn Fokus startet, wechselt oder endet.
es: Muestra los iconos seleccionados al activar, cambiar o desactivar Concentración.
fr: Affiche les icônes choisies quand le Mode Concentration s’active, change ou s’arrête.
id: Tampilkan ikon terpilih saat Fokus menyala, berubah, atau mati.
it: Mostra le icone selezionate quando Concentrazione si attiva, cambia o si disattiva.
ja: 集中モードの開始、変更、終了で、選んだアイコンを表示します。
ko: 집중 모드가 켜지거나 바뀌거나 꺼질 때 선택한 아이콘을 표시합니다.
nl: Toont de gekozen iconen als Focus aangaat, wisselt of uitgaat.
pt_br: Mostra os ícones selecionados quando o Foco liga, muda ou desliga.
th: แสดงไอคอนที่เลือกเมื่อโฟกัสเปิด เปลี่ยน หรือปิด
vi: Hiện biểu tượng đã chọn khi Tập trung bật, đổi hoặc tắt.
zh_hans: 专注模式打开、切换或关闭时，显示所选图标。
zh_hant: 專注模式打開、切換或關閉時，顯示所選圖示。

source: Run your own script to decide when hidden icons should show or hide
de: Ein eigenes Skript entscheidet, wann ausgeblendete Symbole erscheinen oder verschwinden.
es: Un script propio decide cuándo mostrar u ocultar los iconos.
fr: Un script à vous décide quand afficher ou masquer les icônes.
id: Pakai skrip Anda sendiri untuk menentukan kapan ikon muncul atau tersembunyi.
it: Uno script tuo decide quando mostrare o nascondere le icone.
ja: 独自のスクリプトで、非表示アイコンの表示タイミングを決めます。
ko: 직접 만든 스크립트로 숨긴 아이콘을 언제 보일지 정합니다.
nl: Een eigen script bepaalt wanneer verborgen iconen verschijnen of verdwijnen.
pt_br: Um script seu decide quando mostrar ou ocultar os ícones.
th: ใช้สคริปต์ของคุณเองตัดสินว่าจะแสดงหรือซ่อนไอคอนเมื่อใด
vi: Dùng script của bạn để quyết hiện hay ẩn biểu tượng.
zh_hans: 用你自己的脚本决定何时显示或隐藏图标。
zh_hant: 用你自己的腳本決定何時顯示或隱藏圖示。

source: \\ Backslash
es: \\ Barra invertida
fr: \\ Barre oblique inversée
id: \\ Garis miring terbalik
it: \\ Barra rovesciata
ja: \\ バックスラッシュ
ko: \\ 백슬래시
pt_br: \\ Barra invertida
th: \\ แบ็กสแลช
vi: \\ Gạch chéo ngược
zh_hans: \\ 反斜线
zh_hant: \\ 反斜線

source: Live
es: En vivo
fr: En direct
id: Langsung
it: Dal vivo
ja: ライブ
ko: 실시간
pt_br: Ao vivo
th: สด
vi: Trực tiếp
zh_hans: 实时
zh_hant: 即時

source: Migration
es: Migración
id: Migrasi
it: Migrazione
ja: 移行
ko: 이전
nl: Migratie
pt_br: Migração
th: ย้าย
vi: Chuyển
zh_hans: 迁移
zh_hant: 轉移

source: Software Updates
es: Actualizaciones de software
fr: Mises à jour logicielles
id: Pembaruan perangkat lunak
it: Aggiornamenti software
ja: ソフトウェアアップデート
ko: 소프트웨어 업데이트
pt_br: Atualizações de software
th: อัปเดตซอฟต์แวร์
vi: Cập nhật phần mềm
zh_hans: 软件更新
zh_hant: 軟體更新

source: Status
es: Estado
fr: État
it: Stato
ja: 状況
ko: 상태
th: สถานะ
vi: Trạng thái
zh_hans: 状态
zh_hant: 狀態

source: Workflow
es: de trabajo
fr: essentiel
id: alur kerja
it: di lavoro
ja: ワークフロー
ko: 워크플로
pt_br: de trabalho
th: เวิร์กโฟลว์
vi: chính
zh_hans: 流程
zh_hant: 流程

source: Extra
id: Ekstra
ja: 追加
ko: 추가
th: เพิ่ม
vi: Thêm
zh_hans: 额外
zh_hant: 額外

source: Normal
it: Normale
ja: 通常
ko: 보통
nl: Normaal
th: ปกติ
vi: Bình thường
zh_hans: 正常
zh_hant: 一般

source: Normal (%ds)
it: Normale (%ds)
ja: 通常 (%ds)
ko: 보통 (%ds)
nl: Normaal (%ds)
th: ปกติ (%ds)
vi: Bình thường (%ds)
zh_hans: 正常 (%ds)
zh_hant: 一般 (%ds)

source: OK
ko: 승인
th: ตกลง
zh_hans: 好
zh_hant: 好

source: %lld always hidden
zh_hans: %lld 个始终隐藏
zh_hant: %lld 個一律隱藏

source: %lld hidden
zh_hans: %lld 个已隐藏
zh_hant: %lld 個已隱藏

source: %lld icons
zh_hans: %lld 个图标
zh_hant: %lld 個圖示

source: %lld visible
zh_hans: %lld 个可见
zh_hant: %lld 個可見

source: Browse actions help
zh_hans: 浏览操作帮助
zh_hant: 瀏覽操作說明

source: CLICK!
zh_hans: 点击！
zh_hant: 點一下！

source: Create a restore point before using layout restore.
zh_hans: 请先创建还原点，再使用布局还原。
zh_hant: 請先建立還原點，再使用佈局還原。

source: Create a restore point first.
zh_hans: 请先创建还原点。
zh_hant: 請先建立還原點。

source: Fix HaoBar items
zh_hans: 修复 HaoBar 项目
zh_hant: 修復 HaoBar 項目

source: Fix menu bar geometry
zh_hans: 修复菜单栏几何
zh_hant: 修復選單列幾何

source: General
zh_hans: 通用
zh_hant: 一般

source: HaoBar cannot save this layout yet because its menu bar positions need checking. Run Arrange Now, then try again.
zh_hans: HaoBar 还不能保存此布局，因为菜单栏位置需要检查。请先点「立即整理」，然后再试。
zh_hant: HaoBar 還不能儲存此佈局，因為選單列位置需要檢查。請先點「立即整理」，然後再試。

source: HaoBar cannot save this layout yet because macOS has not attached its menu bar items. Run Arrange Now, then try again.
zh_hans: HaoBar 还不能保存此布局，因为 macOS 尚未挂上菜单栏项目。请先点「立即整理」，然后再试。
zh_hant: HaoBar 還不能儲存此佈局，因為 macOS 尚未掛上選單列項目。請先點「立即整理」，然後再試。

source: HaoBar cannot save this layout yet because macOS has not provided trustworthy menu bar positions. Run Arrange Now, then try again.
zh_hans: HaoBar 还不能保存此布局，因为 macOS 尚未提供可信的菜单栏位置。请先点「立即整理」，然后再试。
zh_hant: HaoBar 還不能儲存此佈局，因為 macOS 尚未提供可信的選單列位置。請先點「立即整理」，然後再試。

source: Import Layout
zh_hans: 导入布局
zh_hant: 匯入佈局

source: Last good layout restored.
zh_hans: 已恢复上次正常的布局。
zh_hant: 已恢復上次正常的佈局。

source: Layout still needs attention.
zh_hans: 布局仍需处理。
zh_hant: 佈局仍需處理。

source: Live checks enabled.
zh_hans: 已启用实时检查。
zh_hant: 已啟用即時檢查。

source: Live checks enabled. Verifying layout...
zh_hans: 已启用实时检查。正在验证布局…
zh_hant: 已啟用即時檢查。正在驗證佈局…

source: macOS may be hiding HaoBar's icon behind the notch or because the menu bar is full. macOS doesn't let apps force their own icon back on screen, so this is fixed at the system level: open Menu Bar settings to manage what's shown, remove or reorder other menu-bar icons, or move HaoBar's icon to the immediate left of Control Center.
zh_hans: macOS 可能把 HaoBar 的图标藏在刘海后面，或因为菜单栏已满而隐藏。macOS 不允许应用把自己的图标强制拉回屏幕，所以需要在系统层面处理：打开“菜单栏”设置来管理显示内容，移除或重新排列其他菜单栏图标，或把 HaoBar 的图标移到控制中心正左侧。
zh_hant: macOS 可能把 HaoBar 的圖示藏在瀏海後面，或因為選單列已滿而隱藏。macOS 不允許 App 把自己的圖示強制拉回螢幕，所以需要在系統層級處理：打開「選單列」設定來管理顯示內容，移除或重新排列其他選單列圖示，或把 HaoBar 的圖示移到控制中心正左側。

source: macOS may be hiding HaoBar's icons. Check System Settings > Menu Bar > Allow in Menu Bar for HaoBar.
zh_hans: macOS 可能正在隐藏 HaoBar 的图标。请到系统设置 > 菜单栏 > 允许在菜单栏中，确认 HaoBar 已开启。
zh_hant: macOS 可能正在隱藏 HaoBar 的圖示。請到系統設定 > 選單列 > 允許在選單列中，確認 HaoBar 已開啟。

source: Menu bar health report
zh_hans: 菜单栏健康报告
zh_hant: 選單列健康報告

source: No data collected.
zh_hans: 不收集数据。
zh_hant: 不收集資料。

source: Open Accessibility settings
zh_hans: 打开辅助功能设置
zh_hant: 打開輔助使用設定

source: Open Accessibility settings and enable %@. If that switch is already on, it belongs to another HaoBar copy — turn this one off and on, then click Try Again.
zh_hans: 打开辅助功能设置并启用 %@。如果开关已经是开的，那是另一份 HaoBar — 先关掉再打开这一份，然后点「再试一次」。
zh_hant: 打開輔助功能設定並啟用 %@。如果開關已經是開的，那是另一份 HaoBar — 先關掉再開啟這一份，然後點「再試一次」。

source: Open macOS Menu Bar settings
zh_hans: 打开 macOS 菜单栏设置
zh_hant: 打開 macOS 選單列設定

source: Permissions
zh_hans: 权限
zh_hant: 權限

source: Rechecks this HaoBar copy after you enable the matching switch.
zh_hans: 在你打开对应开关后，重新检查这个 HaoBar 副本。
zh_hant: 在你打開對應開關後，重新檢查這個 HaoBar 副本。

source: Repair check finished.
zh_hans: 修复检查已完成。
zh_hant: 修復檢查已完成。

source: Repair is running. HaoBar will clear the wake repair note after the layout restore finishes.
zh_hans: 正在修复。HaoBar 会在布局还原完成后清除唤醒修复提示。
zh_hant: 正在修復。HaoBar 會在佈局還原完成後清除喚醒修復提示。

source: Repairing layout...
zh_hans: 正在修复布局…
zh_hant: 正在修復佈局…

source: Restores the saved layout point, recreates HaoBar's menu bar items, then runs the same repair path as Arrange Now.
zh_hans: 恢复已保存的布局点，重新创建 HaoBar 的菜单栏项目，然后走与「立即整理」相同的修复路径。
zh_hant: 恢復已儲存的佈局點，重新建立 HaoBar 的選單列項目，然後走與「立即整理」相同的修復路徑。

source: Show Hidden Bar
zh_hans: 显示隐藏条
zh_hant: 顯示隱藏列

source: Keep visible icons right of the notch
zh_hans: 可见图标只留在刘海右侧
zh_hant: 可見圖示只留在瀏海右側

source: On notched Macs, extra visible icons move to Hidden. Click HaoBar to open them.
zh_hans: 在刘海屏上，多出来的可见图标会进隐藏。点 HaoBar 即可打开。
zh_hant: 在瀏海螢幕上，多出來的可見圖示會進入隱藏。點 HaoBar 即可打開。

source: Left-click the HaoBar icon to show hidden icons in a bar under the menu bar.
zh_hans: 左键点 HaoBar 图标，在菜单栏下方显示隐藏图标条。
zh_hant: 左鍵點 HaoBar 圖示，在選單列下方顯示隱藏圖示列。

source: Screen Recording — menu bar only.
zh_hans: 屏幕录制 — 只截菜单栏。
zh_hant: 螢幕錄製 — 只擷取選單列。

source: No video recording.
zh_hans: 不录像。
zh_hant: 不錄影。

source: HaoBar captures the menu bar so hidden icons can appear in the popup bar. It does not record video or upload anything.
zh_hans: HaoBar 只截菜单栏，好在弹条里显示隐藏图标。不录像，也不上传。
zh_hant: HaoBar 只擷取選單列，以便在彈出列顯示隱藏圖示。不錄影，也不上傳。

source: macOS may show a purple screen-capture indicator while HaoBar snapshots the menu bar.
zh_hans: HaoBar 截菜单栏时，系统可能出现紫色「正在截屏」提示。
zh_hant: HaoBar 擷取選單列時，系統可能出現紫色「正在截取畫面」提示。

source: Open Screen Recording Settings
zh_hans: 打开屏幕录制设置
zh_hant: 打開螢幕錄製設定

source: Opens Screen Recording settings so you can grant HaoBar permission.
zh_hans: 打开屏幕录制设置，以便授权 HaoBar。
zh_hant: 打開螢幕錄製設定，以便授權 HaoBar。

source: Relaunch HaoBar after enabling Screen Recording.
zh_hans: 打开屏幕录制后，请重新打开 HaoBar。
zh_hant: 開啟螢幕錄製後，請重新打開 HaoBar。

source: No hidden icons.
zh_hans: 没有隐藏图标。
zh_hant: 沒有隱藏圖示。

source: Screen Recording is required to show icon snapshots.
zh_hans: 显示图标截图需要屏幕录制权限。
zh_hant: 顯示圖示擷取需要螢幕錄製權限。

source: Grant Screen Recording
zh_hans: 授权屏幕录制
zh_hant: 授權螢幕錄製

source: HaoBar could not find a display to snapshot.
zh_hans: HaoBar 找不到可以截取的显示器。
zh_hant: HaoBar 找不到可以擷取的顯示器。

source: Screen capture is unavailable on this Mac.
zh_hans: 这台 Mac 无法截屏。
zh_hant: 這台 Mac 無法擷取畫面。
